using System.ComponentModel.DataAnnotations;
using System.ComponentModel.DataAnnotations.Schema;

namespace Rahpele.Models
{
    public class ServicePlan
    {
        [Key]
        public Guid Id { get; set; }
        public string? Title { get; set; }
        public double? Price { get; set; }
        public string? Description { get; set; }
        public int? DurationType { get; set; }
        public int? DurationValue { get; set; }

        public bool? IsDeleted { get; set; }
        public bool? IsConfirmed { get; set; }

        #region rel

        public Guid? ServiceId { get; set; }
        [ForeignKey(nameof(ServiceId))]
        public Service? Service { get; set; }

        #endregion

        //فروش و بازریابی
        ///کارشناس فروش
        ///کارمند فروش
        ///بازاریاب و ویزیتور
        ///پروموتر
        ///مدیر بازاریابی
        ///مدیر فروش
        ///فروشنده
        ///نماینده علمی فروش
        ///فروش و بازاریابی بیمه
        ///نمایندگی بیمه
        ///برنامه ریزی فروش
        ///کارشناس خدمات پس از فروش
        ///کارشناس تحقیقات بازار
        ///کارشناس تبلیغات
        ///مرچندایزر
        ///مسئول چیدمان
        ///تحلیلگر بازار
        ///مدیر تبلیغات
        ///فروش و بازاریابی کارت تخفیف
        ///نمایندگی کارت تخفیف
        ///



        //فنی مهندسی
        ///مهندس مکانیک
        ///مهندس صنایع
        ///مهندس برق و الکترونیک
        ///تکنسین الکترونیک
        ///تکنسین مکانیک
        ///مهندس شیمی
        ///تکنسین فنی
        ///مهندس متالورژی
        ///مهندس مواد
        ///مهندس صنایع غذایی
        ///مهندس کشاورزی
        ///نقشه کش صنعتی
        ///مهندس پلیمر و رنگ
        ///مهندس معدن
        ///تکنسین تاسیسات ساختمان
        ///طراحی صنعتی
        ///مهندس پزشکی
        ///مهندس اتومکانیک
        ///مهندس نساجی
        ///مهندس نفت
        ///کارشناس GIS
        ///مهندس هسته ای
        ///

        //حسابداری و مالی
        ///حسابدار
        ///کارمند مالی
        ///کمک حسابدار
        ///مدیر مالی
        ///حسابدار ارشد
        ///منشی آشنا به حسابداری
        ///حسابرس
        ///کارشناس وصول مطالبات
        ///مشاور مالی
        ///

        //اداری و دفتری
        ///کارمند اداری
        ///منشی
        ///مسئول دفتر
        ///منشی مدیر عامل
        ///کارشناس منابع انسانی
        ///کارشناس ارتباط با مشتری
        ///منشی آشنا به زبان انگلیسی
        ///کارمند آژانس مسافرتی
        ///کارمند پذیرشگر
        ///منشی مطب
        ///کارمند آشنا به زبان انگلیسی
        ///کارمند روابط عمومی
        ///کارشناس امور مهاجرت
        ///تایپیست
        ///اپراتور کامپیوتر
        ///کارمند بیمه
        ///کارمند رزرویشن
        ///

        //کامپیوتر نرم افزار IT
        ///برنامه نویس
        ///مهندس کامپیوتر
        ///طراح وب سایت
        ///تکنسین شبکه
        ///متخصص شبکه
        ///کارشناس شبکه های اجتماعی
        ///کارشناس دیجیتال مارکتینگ
        ///help desk
        ///پشتیبان نرم افزار
        ///تکنسین کامپیوتر
        ///وردپرس کار
        ///متخصص SEO
        ///پشتیبان سایت
        ///نصاب دوربین و دزدگیر
        ///طراح UI/UX
        ///کارشناس تست نرم افزار
        ///متخصص پایگاه داده
        ///مدیر سرور
        ///نصاب شبکه
        ///کارشناس امنیت سایبری
        ///مدیر پروژه نرم افزار
        ///دکل کار
        ///نصاب اینترنت
        ///مدیر وب سایت
        ///گرافیست وب
        ///

        //کارگر
        ///نظافتچی
        ///آبدارچی
        ///کارگر ساده
        ///کارگر انبار
        ///نگهبان
        ///بسته بند
        ///سرایدار
        ///کارگر چاپ و صحافی
        ///لابی من
        ///خانه دار هتل
        ///خدمتکار منزل
        ///پارکبان
        ///تراکت پخش کن
        ///کارواش کار
        ///

        //صنایع و تولید
        ///کارشناس کنترل کیفی
        ///کارشناس برنامه ریزی و تولید
        ///کارشناس HSE
        ///کارشناس تضمین کیفیت
        ///مدیر کنترل کیفی
        ///کارشناس ERP
        ///مدیر کارخانه
        ///مدیر تضمین کیفیت
        ///کارشناس ایزو
        ///

        //هتل ، رستوران و قنادی
        ///کانتردار
        ///مهماندار
        ///پذیرشگر رستوران
        ///آشپز
        ///صندوقدار
        ///سالن کار
        ///گارسون
        ///باریستا
        ///کافی من
        ///کارگر رستوران
        ///مدیر رستوران
        ///ظرف شوی
        ///پیتزا زن
        ///قناد و شیرینی پز
        ///فرکار
        ///سالاد زن
        ///مدیر هتل
        ///تخته کار
        ///ساندویچ زن
        ///

        //کارگر ماهر
        ///اپراتور تولید
        ///اپراتور دستگاه
        ///مونتاژ کار
        ///جوشکار
        ///تراشکار
        ///کار CNC
        ///برق کار صنعتی
        ///لوله کش
        ///فرزکار
        ///برقکار
        ///فالبساز
        ///صحاف و چاپ
        ///کار MDF
        ///کابینت ساز
        ///تزریق کار پلاستیک
        ///نصاب
        ///آهنگر
        ///پرس کار
        ///طلاساز
        ///نجار
        ///ورق کار
        ///باغبان
        ///فلزکار
        ///کارگر ماهر ساختمانی
        ///قصاب
        ///مبل ساز
        ///نانوا
        ///بنا
        ///شیشه بر
        ///کارگر ماهر کیف و کفش
        ///کارگر ماهر گوشت و مرغ
        ///نقاش ساختمان
        ///قالی باف
        ///کاشی کار
        ///کناف کار
        ///گچ کار
        ///

        //خرید،تدارکات و زنجیره تامین
        ///انباردار
        ///کارشناس خرید و تدارکات
        ///مدیر انبار
        ///کارشناس لجستیک
        ///

        //درمان ، پزشکی و سلامتی
        ///MED REP
        ///پرستار
        ///روانشناس
        ///دستیار دندانپزشک
        ///پزشک
        ///مشاور پوست و مو
        ///تکنسین داروخانه
        ///نسخه پیچ
        ///دستیار پزشک
        ///دامپزشک
        ///داروساز
        ///دندانپزشک
        ///اپراتور لیزر پزشکی
        ///نگهدار کودک و سالمند
        ///تکنسین آزمایشگاه
        ///ماساژور
        ///تکنسین اتاق عمل
        ///مددکار
        ///بهیار
        ///مشاور تغذیه
        ///تکنسین بیهوشی
        ///رادیولوژییست
        ///تکنسین فوریت های پزشکی
        ///ماما
        ///اپتومتریست
        ///تکنسین درمانی
        ///دندانساز
        ///فیزیوتراپ
        ///کارشناس مدارک پزشکی
        ///پیراپزشک
        ///طب سنتی
        ///شنوایی سنج


    }
}
